<?php 
$fruits = ["apple" =>"りんご", "orange" => "みかん", "peach" => "もも"];
foreach($fruits as $key =>$value) {
  echo $key;
  echo "といったら";
  echo $value;
  echo "<br>";
}
?>
<p>
<ul><li>1. トランザクション
商取引、売買、執行、取扱、議事録などの意味の他に、ソフトウェアの処理方式の一つで、互いに関連・依存する複数の処理をまとめ、金融機関のコンピュータシステムにおける入出金処理のように、一体不可分の処理単位として扱うことを指す場合が多い。</li>
<li>2. 排他ロック
データベースシステムなどで記憶領域への同時アクセスを制限するロック機構の一つで、内容が破損したり処理に矛盾が生じるため、先にアクセスした主体が処理の終了まで一時的に他の主体によるアクセスを制限・禁止する仕組み</li>
<li>3. チューニング
システムやプログラムなどを改良し、パフォーマンスの向上を図ること</li>
</ul>
</p>